xml-v4/InformationRegisters/TL_СоответствиеИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>TL_СоответствиеИсточников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СсылкаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПоследнегоПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХешПоследнегоПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TL_ТипОбъектаИсточника</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникUUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml-v4/Enums/TL_ТипОбъектаИсточника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>TL_ТипОбъектаИсточника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчётОРозничныхПродажах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПКО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентаризация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оприходование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускБлюд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребованиеНакладная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml-v4/CommonModules/TL_МаппингЦБ/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль TL_МаппингЦБ
// Расширение ElsyPlus Ledger v6.0 для 1С:БП 3.0
// Контекст: Сервер
//
// Маппинг UUID источника (ЦБ ЭЛСИ.АЗК) на объекты БП ГИГ через
// РегистрСведений.TL_СоответствиеИсточников. Источник правды:
// контракт §6 (НСИ) + §8 (Перечисления) — 09_Контракт_HTTP_ЦБ_БП.md.
//
// Каждая функция возвращает либо ссылку на объект БП, либо Неопределено.
// При создании новой связки автоматически записывает соответствие.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// ============================================================================
//  ОРГАНИЗАЦИЯ
// ============================================================================

// Найти Организацию БП по UUID источника или по ИНН (fallback).
// Контракт §6.1.
//
// Параметры:
//   ИсточникUUID - Строка - UUID Catalog.Организации в ЦБ
//   ИНН          - Строка - ИНН для fallback-поиска (опц.)
//
// Возвращаемое значение:
//   СправочникСсылка.Организации или Неопределено
//
Функция ПолучитьОрганизациюПоUUID(ИсточникUUID, ИНН = "") Экспорт

	Если Не ЗначениеЗаполнено(ИсточникUUID) Тогда
		Возврат Неопределено;
	КонецЕсли;

	// 1. Через регистр соответствий
	Ссылка = НайтиСоответствие(Перечисления.TL_ТипОбъектаИсточника.Организация, ИсточникUUID);
	Если Ссылка <> Неопределено Тогда
		Возврат Ссылка;
	КонецЕсли;

	// 2. Через ИНН в БП ГИГ
	Если ЗначениеЗаполнено(ИНН) Тогда
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.Организации
			|ГДЕ ИНН = &ИНН И НЕ ПометкаУдаления");
		Запрос.УстановитьПараметр("ИНН", ИНН);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаписатьСоответствие(Перечисления.TL_ТипОбъектаИсточника.Организация,
				ИсточникUUID, Выборка.Ссылка);
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// ============================================================================
//  КОНТРАГЕНТ
// ============================================================================

// Найти Контрагента БП по UUID источника или по ИНН (fallback).
// Контракт §6.2.
//
// Параметры:
//   ИсточникUUID - Строка - UUID Catalog.Контрагенты в ЦБ
//   ИНН          - Строка - ИНН для fallback (опц.)
//
// Возвращаемое значение:
//   СправочникСсылка.Контрагенты или Неопределено
//
Функция ПолучитьКонтрагентаПоUUID(ИсточникUUID, ИНН = "") Экспорт

	Если Не ЗначениеЗаполнено(ИсточникUUID) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Ссылка = НайтиСоответствие(Перечисления.TL_ТипОбъектаИсточника.Контрагент, ИсточникUUID);
	Если Ссылка <> Неопределено Тогда
		Возврат Ссылка;
	КонецЕсли;

	// Поиск по ИНН с правилом «активного» (контракт §10 №8): берём не помеченного на удаление
	Если ЗначениеЗаполнено(ИНН) Тогда
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.Контрагенты
			|ГДЕ ИНН = &ИНН И НЕ ПометкаУдаления
			|УПОРЯДОЧИТЬ ПО ДатаРедактирования УБЫВ");
		Запрос.УстановитьПараметр("ИНН", ИНН);
		Попытка
			Выборка = Запрос.Выполнить().Выбрать();
		Исключение
			// Реквизит ДатаРедактирования может отсутствовать — повторим без сортировки
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.Контрагенты
				|ГДЕ ИНН = &ИНН И НЕ ПометкаУдаления";
			Выборка = Запрос.Выполнить().Выбрать();
		КонецПопытки;
		Если Выборка.Следующий() Тогда
			ЗаписатьСоответствие(Перечисления.TL_ТипОбъектаИсточника.Контрагент,
				ИсточникUUID, Выборка.Ссылка);
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// ============================================================================
//  ДОГОВОР
// ============================================================================

// Найти или создать Договор БП по UUID источника.
// Контракт §6.3 — автосоздание при наличии параметров.
//
// Параметры:
//   ИсточникUUID - Строка - UUID Catalog.ДоговорыКонтрагентов в ЦБ
//   Контрагент   - СправочникСсылка.Контрагенты - владелец (уже найден)
//   Параметры    - Структура - { Наименование, Номер, Дата, ВидДоговора, Валюта }
//                              для автосоздания при отсутствии
//
// Возвращаемое значение:
//   СправочникСсылка.ДоговорыКонтрагентов или Неопределено
//
Функция ПолучитьДоговорПоUUID(ИсточникUUID, Контрагент, Параметры = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(ИсточникUUID) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Ссылка = НайтиСоответствие(Перечисления.TL_ТипОбъектаИсточника.Договор, ИсточникUUID);
	Если Ссылка <> Неопределено Тогда
		Возврат Ссылка;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Неопределено;
	КонецЕсли;

	// Поиск в БП по (Контрагент, Номер, Дата)
	Если Параметры <> Неопределено И Параметры.Свойство("Номер") Тогда
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.ДоговорыКонтрагентов
			|ГДЕ Владелец = &Контрагент И Номер = &Номер И НЕ ПометкаУдаления");
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Номер", Параметры.Номер);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаписатьСоответствие(Перечисления.TL_ТипОбъектаИсточника.Договор,
				ИсточникUUID, Выборка.Ссылка);
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;

	// Автосоздание при наличии достаточных параметров
	Если Параметры <> Неопределено И Параметры.Свойство("Номер") Тогда
		Попытка
			Договор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			Договор.Владелец = Контрагент;
			Договор.Номер = Параметры.Номер;
			Если Параметры.Свойство("Дата") И ЗначениеЗаполнено(Параметры.Дата) Тогда
				Договор.Дата = Параметры.Дата;
			КонецЕсли;
			Договор.Наименование = ?(Параметры.Свойство("Наименование")
				И ЗначениеЗаполнено(Параметры.Наименование),
				Параметры.Наименование,
				"Договор " + Параметры.Номер);
			Договор.ВидДоговора = СопоставитьВидДоговора(?(Параметры.Свойство("ВидДоговора"),
				Параметры.ВидДоговора, "СПоставщиком"));
			Попытка
				Договор.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("643");
			Исключение
			КонецПопытки;
			Договор.Записать();
			ЗаписатьСоответствие(Перечисления.TL_ТипОбъектаИсточника.Договор,
				ИсточникUUID, Договор.Ссылка);
			Возврат Договор.Ссылка;
		Исключение
			ЗаписьЖурналаРегистрации("TL_МаппингЦБ",
				УровеньЖурналаРегистрации.Ошибка, , ,
				"Не удалось создать договор " + ИсточникUUID + ": " + ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// ============================================================================
//  СКЛАД
// ============================================================================

// Найти Склад БП по UUID источника или по эвристике имени.
// Контракт §6.4.
//
// Параметры:
//   ИсточникUUID - Строка
//   Наименование - Строка - имя склада из ЦБ для fallback (опц.)
//
// Возвращаемое значение:
//   СправочникСсылка.Склады или Неопределено
//
Функция ПолучитьСкладПоUUID(ИсточникUUID, Наименование = "") Экспорт

	Если Не ЗначениеЗаполнено(ИсточникUUID) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Ссылка = НайтиСоответствие(Перечисления.TL_ТипОбъектаИсточника.Склад, ИсточникUUID);
	Если Ссылка <> Неопределено Тогда
		Возврат Ссылка;
	КонецЕсли;

	// Эвристика по имени: «АЗС №208, Торговый зал» → ищем «АЗС 208» / «АЗС №208» / «АГЗС 208 Выборг»
	Если ЗначениеЗаполнено(Наименование) Тогда
		НомерАЗС = ИзвлечьНомерАЗС(Наименование);
		Если НомерАЗС > 0 Тогда
			Кандидат = НайтиСкладПоНомеру(НомерАЗС);
			Если ЗначениеЗаполнено(Кандидат) Тогда
				ЗаписатьСоответствие(Перечисления.TL_ТипОбъектаИсточника.Склад,
					ИсточникUUID, Кандидат);
				Возврат Кандидат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// ============================================================================
//  НОМЕНКЛАТУРА
// ============================================================================

// Найти Номенклатуру БП по UUID источника.
// Контракт §6.5: на A3 автосоздание ВЫКЛЮЧЕНО — приёмник полагается на ручное
// сопоставление через DataProcessor.TL_СоответствияИсточников. На A4 включается
// автосоздание + запись в TL_МСН_Зеркало (отдельная задача).
//
// Параметры:
//   ИсточникUUID - Строка
//
// Возвращаемое значение:
//   СправочникСсылка.Номенклатура или Неопределено
//
Функция ПолучитьНоменклатуруПоUUID(ИсточникUUID) Экспорт

	Если Не ЗначениеЗаполнено(ИсточникUUID) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат НайтиСоответствие(Перечисления.TL_ТипОбъектаИсточника.Номенклатура, ИсточникUUID);

КонецФункции

// ============================================================================
//  СТАВКА НДС
// ============================================================================

// Сопоставить имя ставки НДС из JSON с перечислением БП ГИГ.
// Контракт §8.1 — 14 значений. Источник нормализует имена до записи в JSON
// (`НДС05` → `НДС5`).
//
// Параметры:
//   ИмяСтавки - Строка - "НДС20" / "НДС22" / "НДС5" / ...
//
// Возвращаемое значение:
//   ПеречислениеСсылка.СтавкиНДС или ПустаяСсылка при неизвестном имени
//
Функция СопоставитьСтавкуНДС(ИмяСтавки) Экспорт

	Если Не ЗначениеЗаполнено(ИмяСтавки) Тогда
		Возврат Перечисления.СтавкиНДС.ПустаяСсылка();
	КонецЕсли;

	Имя = СокрЛП(ИмяСтавки);

	// Прямой маппинг по имени (полный список §8.1 контракта)
	Если Имя = "НДС18"     Тогда Возврат Перечисления.СтавкиНДС.НДС18;     КонецЕсли;
	Если Имя = "НДС18_118" Тогда Возврат Перечисления.СтавкиНДС.НДС18_118; КонецЕсли;
	Если Имя = "НДС10"     Тогда Возврат Перечисления.СтавкиНДС.НДС10;     КонецЕсли;
	Если Имя = "НДС10_110" Тогда Возврат Перечисления.СтавкиНДС.НДС10_110; КонецЕсли;
	Если Имя = "НДС0"      Тогда Возврат Перечисления.СтавкиНДС.НДС0;      КонецЕсли;
	Если Имя = "БезНДС"    Тогда Возврат Перечисления.СтавкиНДС.БезНДС;    КонецЕсли;
	Если Имя = "НДС20"     Тогда Возврат Перечисления.СтавкиНДС.НДС20;     КонецЕсли;
	Если Имя = "НДС20_120" Тогда Возврат Перечисления.СтавкиНДС.НДС20_120; КонецЕсли;

	// НДС22 / НДС22_122 / НДС5 / НДС5_105 / НДС7 / НДС7_107 — fail-fast (ревизия 16.05.2026).
	// Раньше был тихий fallback на НДС20 через Попытка/Исключение — это создавало риск
	// повторения ошибки НЛ (НДС10 пищевки превращался в НДС22 через ВидСтавкиНДС=Общая).
	// Теперь: если ставка не найдена в БП ГИГ — возвращаем ПустаяСсылка, вызывающий код
	// записывает ошибку в TL_ОшибкиЗагрузки и НЕ создаёт документ.
	// На современной БП ГИГ (3.0.194.18+) эти ставки есть — Попытка не нужна.
	Если Имя = "НДС22"     Тогда Возврат Перечисления.СтавкиНДС.НДС22;     КонецЕсли;
	Если Имя = "НДС22_122" Тогда Возврат Перечисления.СтавкиНДС.НДС22_122; КонецЕсли;
	Если Имя = "НДС5"      Тогда Возврат Перечисления.СтавкиНДС.НДС5;      КонецЕсли;
	Если Имя = "НДС5_105"  Тогда Возврат Перечисления.СтавкиНДС.НДС5_105;  КонецЕсли;
	Если Имя = "НДС7"      Тогда Возврат Перечисления.СтавкиНДС.НДС7;      КонецЕсли;
	Если Имя = "НДС7_107"  Тогда Возврат Перечисления.СтавкиНДС.НДС7_107;  КонецЕсли;

	// Неизвестная ставка — fail-fast (без подмен на НДС20). Вызывающий код пишет ошибку
	// в TL_ОшибкиЗагрузки с кодом СтавкаНДС_НеСопоставлена и не создаёт документ.
	ЗаписьЖурналаРегистрации("TL_МаппингЦБ",
		УровеньЖурналаРегистрации.Ошибка, , ,
		"Неизвестная ставка НДС '" + Имя + "' — документ не будет создан (см. TL_ОшибкиЗагрузки)");
	Возврат Перечисления.СтавкиНДС.ПустаяСсылка();

КонецФункции

// ============================================================================
//  ВИД ДОГОВОРА
// ============================================================================

// Сопоставить имя вида договора из JSON с перечислением БП.
// Контракт §8.4.
//
Функция СопоставитьВидДоговора(Имя) Экспорт

	Имя = СокрЛП(Имя);
	Если Имя = "СПоставщиком"  Тогда Возврат Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;  КонецЕсли;
	Если Имя = "СПокупателем"  Тогда Возврат Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;  КонецЕсли;
	Если Имя = "СКомитентом"   Тогда Возврат Перечисления.ВидыДоговоровКонтрагентов.СКомитентом;   КонецЕсли;
	Если Имя = "СКомиссионером"Тогда Возврат Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером;КонецЕсли;
	Если Имя = "Прочее"        Тогда Возврат Перечисления.ВидыДоговоровКонтрагентов.Прочее;        КонецЕсли;
	Возврат Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;

КонецФункции

// ============================================================================
//  СЧЕТА УЧЁТА (фактическая практика БП ГИГ)
// ============================================================================

// Счёт учёта товара на основании KindДокумента и КлассSKU.
// Контракт §6.6 + §7.2.
// На A3 — единая константа 41.02 для всей сопутки (вариант А).
//
Функция ОпределитьСчётУчётаТовара(KindДокумента = "purchase", КлассSKU = "") Экспорт

	Возврат ПолучитьСчётПоКоду("41.02");

КонецФункции

// Счёт учёта НДС.
// На A3 — 19.03.
//
Функция ОпределитьСчётНДС() Экспорт
	Возврат ПолучитьСчётПоКоду("19.03");
КонецФункции

// Счёт расчётов с контрагентом.
// На A3 — 60.01.
//
Функция ОпределитьСчётРасчётовКонтрагент() Экспорт
	Возврат ПолучитьСчётПоКоду("60.01");
КонецФункции

// Счёт расчётов по авансам.
// На A3 — 60.02.
//
Функция ОпределитьСчётРасчётовАвансы() Экспорт
	Возврат ПолучитьСчётПоКоду("60.02");
КонецФункции

// ============================================================================
//  ВИД ОПЕРАЦИИ ПОСТУПЛЕНИЯ В БП
// ============================================================================

// Сопоставить ВидОперации из JSON с ВидыОперацийПоступлениеТоваровУслуг БП.
// Контракт §8.3 — на A3 единственный маппинг ОтПоставщика → Товары.
//
Функция СопоставитьВидОперацииПоступление(ИмяИзJSON) Экспорт

	Имя = СокрЛП(ИмяИзJSON);
	Если Имя = "ОтПоставщика" Тогда
		Возврат Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Товары;
	КонецЕсли;
	// Прочие на A3 не маппятся
	Возврат Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПустаяСсылка();

КонецФункции

// ============================================================================
//  ВИД ОПЛАТЫ (РОЗНИЦА) — Catalog.ВидыОплатОрганизаций
// ============================================================================

// Сопоставить имя вида оплаты из JSON ЦБ с Catalog.ВидыОплатОрганизаций.
// Используется для kind=retail_sale_sidegoods.
//
// Логика:
//   - "Наличные" → Пустая ссылка (наличные НЕ идут в ТЧ Оплата, отражаются
//     через СчетКасса=50.01 в шапке).
//   - "Карты МПС" / "Карта МПС" / "МИР" / "Visa" / ... → ищем в Catalog
//     по точному имени или фрагменту, при отсутствии создаём новую запись.
//
Функция СопоставитьВидОплатыРозница(ИмяВидаОплаты) Экспорт

	Имя = СокрЛП(ИмяВидаОплаты);
	Если Имя = "" ИЛИ Имя = "Наличные" Тогда
		Возврат Справочники.ВидыОплатОрганизаций.ПустаяСсылка();
	КонецЕсли;

	// 1. Точное совпадение имени
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.ВидыОплатОрганизаций
		|ГДЕ Наименование = &Н И НЕ ПометкаУдаления");
	Запрос.УстановитьПараметр("Н", Имя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	// 2. Эвристика: если имя содержит «карт», берём «Платежная карта» (типовой)
	Если Найти(НРег(Имя), "карт") > 0 Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.ВидыОплатОрганизаций
			|ГДЕ Наименование = ""Платежная карта"" И НЕ ПометкаУдаления";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;

	// 3. Автосоздание новой записи (на случай экзотических каналов оплат)
	Попытка
		ВО = Справочники.ВидыОплатОрганизаций.СоздатьЭлемент();
		ВО.Наименование = Имя;
		ВО.Записать();
		Возврат ВО.Ссылка;
	Исключение
		ЗаписьЖурналаРегистрации("TL_МаппингЦБ",
			УровеньЖурналаРегистрации.Ошибка, , ,
			"Не удалось создать ВидОплатыОрганизации '" + Имя + "': " + ОписаниеОшибки());
		Возврат Справочники.ВидыОплатОрганизаций.ПустаяСсылка();
	КонецПопытки;

КонецФункции

// ============================================================================
//  ПОДРАЗДЕЛЕНИЕ ОРГАНИЗАЦИИ (по складу-АЗС)
// ============================================================================

// Найти Catalog.ПодразделенияОрганизаций по складу-АЗС.
// Шаблон: «АЗС 208 г. Выборг» → подразделение «АЗС 208 г. Выборг».
//
Функция ПолучитьПодразделениеПоСкладу(СкладИлиИмя) Экспорт

	Если ТипЗнч(СкладИлиИмя) = Тип("СправочникСсылка.Склады") Тогда
		Имя = СокрЛП(СкладИлиИмя.Наименование);
	Иначе
		Имя = СокрЛП(СкладИлиИмя);
	КонецЕсли;

	Если Имя = "" Тогда
		Возврат Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	КонецЕсли;

	// Точное совпадение
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.ПодразделенияОрганизаций
		|ГДЕ Наименование = &Н И НЕ ПометкаУдаления");
	Запрос.УстановитьПараметр("Н", Имя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	// Поиск по номеру АЗС в имени
	Номер = ИзвлечьНомерАЗС(Имя);
	Если Номер > 0 Тогда
		НомерСтр = XMLСтрока(Номер);
		Шаблоны = Новый Массив;
		Шаблоны.Добавить("%АЗС " + НомерСтр + "%");
		Шаблоны.Добавить("%АЗС №" + НомерСтр + "%");
		Шаблоны.Добавить("%АГЗС " + НомерСтр + "%");
		Шаблоны.Добавить("%(" + НомерСтр + ")%");
		Для Каждого Шаблон Из Шаблоны Цикл
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.ПодразделенияОрганизаций
				|ГДЕ Наименование ПОДОБНО &Ш И НЕ ПометкаУдаления";
			Запрос.УстановитьПараметр("Ш", Шаблон);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Возврат Выборка.Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Справочники.ПодразделенияОрганизаций.ПустаяСсылка();

КонецФункции

// ============================================================================
//  СЧЕТА ДЛЯ РОЗНИЦЫ
// ============================================================================

// Счёт учёта НДС по реализации (для ТЧ Товары в ОРП).
//
Функция ОпределитьСчётНДСРеализация() Экспорт
	Возврат ПолучитьСчётПоКоду("90.03");
КонецФункции

// Счёт доходов по реализации (для ТЧ Товары в ОРП).
//
Функция ОпределитьСчётДоходов() Экспорт
	Возврат ПолучитьСчётПоКоду("90.01.1");
КонецФункции

// Счёт расходов (себестоимости) по реализации.
//
Функция ОпределитьСчётРасходов() Экспорт
	Возврат ПолучитьСчётПоКоду("90.02.1");
КонецФункции

// Счёт кассы для шапки ОРП (наличные).
//
Функция ОпределитьСчётКассы() Экспорт
	Возврат ПолучитьСчётПоКоду("50.01");
КонецФункции

// Статья ДДС для розничной выручки.
//
Функция ОпределитьСтатьюДДСРозница() Экспорт

	// Поиск по типичному имени
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.СтатьиДвиженияДенежныхСредств
		|ГДЕ Наименование = ""Розничная выручка"" И НЕ ПометкаУдаления");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	// Эвристика: первая статья с «выручк» в имени
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.СтатьиДвиженияДенежныхСредств
		|ГДЕ Наименование ПОДОБНО ""%выручк%"" И НЕ ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();

КонецФункции

// ============================================================================
//  ОПЕРАЦИИ С РЕГИСТРОМ TL_СоответствиеИсточников
// ============================================================================

// Записать соответствие (Тип, ИсточникUUID) → СсылкаОбъект.
//
Процедура ЗаписатьСоответствие(Тип, ИсточникUUID, СсылкаОбъект,
	ИдентификаторПакета = "", ХешДокумента = "") Экспорт

	МЗ = РегистрыСведений.TL_СоответствиеИсточников.СоздатьМенеджерЗаписи();
	МЗ.Тип = Тип;
	МЗ.ИсточникUUID = ИсточникUUID;
	МЗ.СсылкаОбъект = СсылкаОбъект;
	МЗ.ДатаПоследнейЗагрузки = ТекущаяДата();
	Если ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		МЗ.ИдентификаторПоследнегоПакета = ИдентификаторПакета;
	КонецЕсли;
	Если ЗначениеЗаполнено(ХешДокумента) Тогда
		МЗ.ХешПоследнегоПакета = ХешДокумента;
	КонецЕсли;
	МЗ.Записать();

КонецПроцедуры

// Найти соответствие — вернуть ссылку на объект БП или Неопределено.
//
Функция НайтиСоответствие(Тип, ИсточникUUID) Экспорт

	Если Не ЗначениеЗаполнено(ИсточникUUID) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СсылкаОбъект
		|ИЗ
		|	РегистрСведений.TL_СоответствиеИсточников
		|ГДЕ
		|	Тип = &Тип И ИсточникUUID = &UUID");
	Запрос.УстановитьПараметр("Тип", Тип);
	Запрос.УстановитьПараметр("UUID", ИсточникUUID);

	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если ЗначениеЗаполнено(Выборка.СсылкаОбъект) Тогда
				Возврат Выборка.СсылкаОбъект;
			КонецЕсли;
		КонецЕсли;
	Исключение
		// Регистр ещё не создан в конфигурации — fallback Неопределено
		ЗаписьЖурналаРегистрации("TL_МаппингЦБ",
			УровеньЖурналаРегистрации.Предупреждение, , ,
			"Регистр TL_СоответствиеИсточников недоступен: " + ОписаниеОшибки());
	КонецПопытки;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Извлечь номер АЗС из имени склада ЦБ.
// "АЗС №208, Торговый зал" → 208
// "АЗС №5" → 5
//
Функция ИзвлечьНомерАЗС(Наименование)

	Имя = СокрЛП(Наименование);
	// Удалить «АЗС №», «АЗС », «АГЗС № » и др. префиксы
	НормИмя = НРег(Имя);
	НормИмя = СтрЗаменить(НормИмя, "азс №", "");
	НормИмя = СтрЗаменить(НормИмя, "азс ", "");
	НормИмя = СтрЗаменить(НормИмя, "агзс №", "");
	НормИмя = СтрЗаменить(НормИмя, "агзс ", "");
	НормИмя = СтрЗаменить(НормИмя, "акзс ", "");
	НормИмя = СтрЗаменить(НормИмя, "акзс №", "");
	НормИмя = СокрЛП(НормИмя);

	// Прочитать ведущие цифры
	Цифры = "";
	Для i = 1 По СтрДлина(НормИмя) Цикл
		Сим = Сред(НормИмя, i, 1);
		Если Сим >= "0" И Сим <= "9" Тогда
			Цифры = Цифры + Сим;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если Не ЗначениеЗаполнено(Цифры) Тогда
		Возврат 0;
	КонецЕсли;

	Попытка
		Возврат Число(Цифры);
	Исключение
		Возврат 0;
	КонецПопытки;

КонецФункции

// Найти склад БП по номеру АЗС, перебирая распространённые шаблоны имён.
// БП ГИГ имеет «АЗС 208 г.Выборг», «АГЗС Симагино», «АКЗС Витебский (5)» и т.п.
//
Функция НайтиСкладПоНомеру(НомерАЗС)

	НомерСтр = XMLСтрока(НомерАЗС);

	Шаблоны = Новый Массив;
	Шаблоны.Добавить("%АЗС " + НомерСтр + "%");
	Шаблоны.Добавить("%АЗС №" + НомерСтр + "%");
	Шаблоны.Добавить("%АГЗС " + НомерСтр + "%");
	Шаблоны.Добавить("%АГЗС №" + НомерСтр + "%");
	Шаблоны.Добавить("%АКЗС " + НомерСтр + "%");
	Шаблоны.Добавить("%(" + НомерСтр + ")%");

	Для Каждого Шаблон Из Шаблоны Цикл
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.Склады
			|ГДЕ Наименование ПОДОБНО &Шаблон И НЕ ПометкаУдаления");
		Запрос.УстановитьПараметр("Шаблон", Шаблон);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;

	Возврат Справочники.Склады.ПустаяСсылка();

КонецФункции

// Поиск счёта по коду (хозрасчётный план счетов).
//
Функция ПолучитьСчётПоКоду(Код)

	Попытка
		Счёт = ПланыСчетов.Хозрасчетный.НайтиПоКоду(Код);
		Если ЗначениеЗаполнено(Счёт) Тогда
			Возврат Счёт;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат ПланыСчетов.Хозрасчетный.ПустаяСсылка();

КонецФункции

#КонецОбласти
